{
  "actions": [],
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Gowthamaraj Rajendran, Splunk"
  ],
  "building_block_type": "default",
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects the execution of Puppet commands with elevated privileges, specifically when Puppet is used to apply configurations with sudo rights. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs that include command-line details. This activity is significant because it indicates a potential privilege escalation attempt, where a user could gain root access and execute system commands as the root user. If confirmed malicious, this could allow an attacker to fully compromise the system, execute arbitrary commands, and maintain persistent control. Rule was converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "false_positives": [
    "False positives may be present, filter as needed."
  ],
  "from": "now-60m",
  "interval": "5m",
  "license": "Apache 2.0",
  "max_signals": 100,
  "name": "Google Gemini 2.0 Flash 001: Linux Puppet Privilege Escalation",
  "note": "### References\n- https://gtfobins.github.io/gtfobins/puppet/\n- https://en.wikipedia.org/wiki/Puppet_(software)",
  "references": [
    "https://gtfobins.github.io/gtfobins/puppet/",
    "https://en.wikipedia.org/wiki/Puppet_(software)"
  ],
  "risk_score": 47,
  "rule_id": "1d19037f-466e-4d56-8d87-36fafd9aa3ce",
  "severity": "medium",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "Linux Privilege Escalation",
    "Linux Living Off The Land",
    "Endpoint",
    "T1548.003",
    "Splunk Enterprise",
    "Splunk Enterprise Security",
    "Splunk Cloud",
    "endpoint"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1548.003",
          "name": "Abuse Elevation Control Mechanism: Sudo and su",
          "reference": "https://attack.mitre.org/techniques/T1548/003/"
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "type": "eql",
  "version": 1,
  "language": "eql",
  "query": "sequence by process.entity_id\n  [process where process.name == \"puppet\" and process.args == \"apply\" and process.args == \"-e\" and process.args == \"exec\" and process.args == \"sudo\"]\n",
  "index": [
    "logs-endpoint.events.*"
  ]
}