{
  "actions": [],
  "author": [
    "Teoderick Contreras, Splunk",
    "Google Gemini 2.0 Flash 001"
  ],
  "building_block_type": "default",
  "description": "The following analytic detects the suspicious sysmon service stop. This behavior is critical for a SOC to monitor because it may indicate attempts to gain unauthorized access or maintain control over a system. Such actions could be signs of malicious activity. If confirmed, this could lead to serious consequences, including a compromised system, unauthorized access to sensitive data, or even a wider breach affecting the entire network. Detecting and responding to these signs early is essential to prevent potential security incidents.\n\nRule converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."
  ],
  "from": "now-60m",
  "interval": "5m",
  "license": "Elastic License v2",
  "name": "Google Gemini 2.0 Flash 001: Linux Auditd Sysmon Service Stop",
  "note": "This rule detects attempts to stop the sysmon service on Linux systems by analyzing auditd logs.  It identifies events where the 'SERVICE_STOP' type is logged for the 'sysmon' unit.",
  "references": [
    "https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html"
  ],
  "risk_score": 47,
  "rule_id": "linux_auditd_sysmon_service_stop",
  "severity": "high",
  "tags": [
    "Linux Living Off The Land",
    "Linux Privilege Escalation",
    "Linux Persistence Techniques",
    "Compromised Linux Host",
    "Endpoint",
    "T1489",
    "Google Gemini 2.0 Flash 001"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1489",
          "name": "Service Stop",
          "reference": "https://attack.mitre.org/techniques/T1489/"
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "type": "eql",
  "version": 1,
  "language": "eql",
  "query": "sequence by audit.session,\n  audit.pid with maxspan=5s\n  {\n    audit where event.type == \"process\" and audit.syscall == \"execve\" and process.name == \"systemctl\" and process.args == \"stop\" and process.args == \"sysmon\"\n  }\n",
  "index": [
    "auditbeat-*"
  ],
  "data_view_id": "global",
  "risk_score_mapping": [],
  "severity_mapping": []
}