{
  "actions": [],
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "building_block_type": "default",
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects suspicious attempts to find private keys, which may indicate an attacker's effort to access sensitive cryptographic information. Private keys are crucial for securing encrypted communications and data, and unauthorized access to them can lead to severe security breaches, including data decryption and identity theft. By monitoring for unusual or unauthorized searches for private keys, this analytic helps identify potential threats to cryptographic security, enabling security teams to take swift action to protect the integrity and confidentiality of encrypted information.",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."
  ],
  "from": "now-60m",
  "interval": "5m",
  "license": "Elastic License v2",
  "name": "Google Gemini 2.0 Flash 001: Linux Auditd Private Keys and Certificate Enumeration",
  "note": "This rule was converted with Google Gemini 2.0 Flash 001",
  "references": [
    "https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html",
    "https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS"
  ],
  "risk_score": 64,
  "rule_id": "linux_auditd_private_keys_and_certificate_enumeration",
  "severity": "medium",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "Linux Living Off The Land",
    "Linux Privilege Escalation",
    "Linux Persistence Techniques",
    "Compromised Linux Host",
    "Endpoint",
    "T1552.004"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0009",
        "name": "Collection",
        "reference": "https://attack.mitre.org/tactics/TA0009/"
      },
      "technique": [
        {
          "id": "T1552",
          "name": "Unsecured Credentials",
          "reference": "https://attack.mitre.org/techniques/T1552/"
        },
        {
          "id": "T1552.004",
          "name": "Private Keys",
          "reference": "https://attack.mitre.org/techniques/T1552/004/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "eql",
  "version": 1,
  "language": "eql",
  "query": "sequence by host.name\n  [process where event.category == \"process\" and event.type == \"start\" and\n   process.name : (\"find\", \"grep\") and process.args : (\"*.pem\", \"*.cer\", \"*.crt\", \"*.pgp\", \"*.key\", \"*.gpg\", \"*.ppk\", \"*.p12\", \"*.pfx\", \"*.p7b\")\n  ]\n",
  "index": [
    "auditbeat-*",
    "filebeat-*",
    "logs-endpoint.events.*",
    "logs-system.*"
  ]
}