{
  "actions": [],
  "author": ["Teoderick Contreras", "OpenAI GPT4-o"],
  "description": "The following analytic detects the deletion of critical directories on a Linux machine using the `rm` command with argument rf. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions targeting directories like /boot, /var/log, /etc, and /dev. This activity is significant because deleting these directories can severely disrupt system operations and is often associated with destructive campaigns like Industroyer2. If confirmed malicious, this action could lead to system instability, data loss, and potential downtime, making it crucial for immediate investigation and response. Converted with OpenAI GPT4-o.",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": ["Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."],
  "from": "now-360s",
  "interval": "5m",
  "investigation_fields": {
    "field_names": []
  },
  "license": "",
  "max_signals": 100,
  "meta": {},
  "name": "OpenAI GPT4-o Linux Deleting Critical Directory Using RM Command",
  "note": "",
  "outcome": "exactMatch",
  "output_index": ".siem-signals-default",
  "references": [
    "https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/",
    "https://cert.gov.ua/article/39518"
  ],
  "related_integrations": [],
  "required_fields": [],
  "risk_score": 64,
  "risk_score_mapping": [],
  "rule_id": "33f89303-cc6f-49ad-921d-2eaea38a6f7a",
  "rule_name_override": "",
  "setup": "",
  "severity": "high",
  "severity_mapping": [],
  "tags": ["OpenAI GPT4-o", "AwfulShred", "Data Destruction", "Industroyer2", "Endpoint"],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0040",
        "name": "Impact",
        "reference": "https://attack.mitre.org/tactics/TA0040/"
      },
      "technique": [
        {
          "id": "T1485",
          "name": "Data Destruction",
          "reference": "https://attack.mitre.org/techniques/T1485/"
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "timeline_id": "",
  "timeline_title": "",
  "timestamp_override": "",
  "timestamp_override_fallback_disabled": true,
  "to": "now",
  "version": 1,
  "language": "eql",
  "query": "process where process.name == \"rm\" and process.args : \"-rf\" and process.args : (\"*/boot/*\", \"*/var/log/*\", \"*/etc/*\", \"*/dev/*\")",
  "type": "eql",
  "alert_suppression": {
    "duration": {
      "unit": "s",
      "value": 3600
    },
    "group_by": ["process.entity_id"],
    "missing_fields_strategy": "doNotSuppress"
  },
  "data_view_id": "",
  "event_category_override": "",
  "filters": [],
  "index": ["logs-*"],
  "tiebreaker_field": "",
  "timestamp_field": "@timestamp"
}