{
  "actions": [],
  "author": ["OpenAI GPT4-o"],
  "description": "The following analytic detects suspicious data transfer activities that involve the use of the `split` syscall, potentially indicating an attempt to evade detection by breaking large files into smaller parts. Attackers may use this technique to bypass size-based security controls, facilitating the covert exfiltration of sensitive data. By monitoring for unusual or unauthorized use of the `split` syscall, this analytic helps identify potential data exfiltration attempts, allowing security teams to intervene and prevent the unauthorized transfer of critical information from the network. Converted with OpenAI GPT4-o.",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": ["Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."],
  "from": "now-6m",
  "interval": "5m",
  "license": "",
  "max_signals": 100,
  "name": "OpenAI GPT4-o Linux Auditd Data Transfer Size Limits Via Split",
  "note": "",
  "outcome": "exactMatch",
  "references": ["https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html"],
  "risk_score": 49,
  "risk_score_mapping": [],
  "rule_id": "linux_auditd_data_transfer_size_limits_via_split",
  "severity": "medium",
  "severity_mapping": [],
  "tags": ["OpenAI GPT4-o", "Linux Living Off The Land", "Linux Privilege Escalation", "Linux Persistence Techniques", "Compromised Linux Host"],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0010",
        "name": "Exfiltration",
        "reference": "https://attack.mitre.org/tactics/TA0010/"
      },
      "technique": [
        {
          "id": "T1030",
          "name": "Data Transfer Size Limits",
          "reference": "https://attack.mitre.org/techniques/T1030/"
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "timeline_id": "",
  "timeline_title": "",
  "timestamp_override": "",
  "timestamp_override_fallback_disabled": false,
  "to": "now",
  "version": 1,
  "language": "eql",
  "query": "process where process.name == \"split\" and process.args : \"*-b *\"",
  "type": "eql",
  "alert_suppression": {
    "duration": {
      "unit": "s",
      "value": 3600
    },
    "group_by": ["host.name"],
    "missing_fields_strategy": "doNotSuppress"
  },
  "data_view_id": "",
  "event_category_override": "",
  "filters": [],
  "index": ["auditd-*"],
  "tiebreaker_field": "",
  "timestamp_field": "@timestamp"
}