{
  "actions": [],
  "author": ["OpenAI GPT4-o"],
  "description": "The following analytic detects processes that clear or free page cache on a Linux system. It leverages Endpoint Detection and Response (EDR) data, focusing on specific command-line executions involving the kernel system request `drop_caches`. This activity is significant as it may indicate an attempt to delete forensic evidence or the presence of wiper malware like Awfulshred. If confirmed malicious, this behavior could allow an attacker to cover their tracks, making it difficult to investigate other malicious activities or system compromises. Converted with OpenAI GPT4-o.",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": ["unknown"],
  "from": "now-360s",
  "interval": "5m",
  "license": "",
  "max_signals": 100,
  "name": "OpenAI GPT4-o Linux Indicator Removal Clear Cache",
  "note": "",
  "outcome": "exactMatch",
  "references": [
    "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/",
    "https://cert.gov.ua/article/3718487"
  ],
  "risk_score": 42,
  "rule_id": "e0940505-0b73-4719-84e6-cb94c44a5245",
  "severity": "medium",
  "tags": ["OpenAI GPT4-o", "AwfulShred", "Data Destruction", "Endpoint"],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1070",
          "name": "Indicator Removal on Host",
          "reference": "https://attack.mitre.org/techniques/T1070/"
        }
      ]
    }
  ],
  "to": "now",
  "type": "query",
  "language": "eql",
  "query": "process where process.name in ('dash', 'sudo', 'bash') and process.command_line : '* echo 3 > *' and process.command_line : '* echo 2 > *' and process.command_line : '* echo 1 > *' and process.command_line : '*/proc/sys/vm/drop_caches'",
  "version": 1
}