{
  "actions": [],
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "building_block_type": "default",
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects attempts to access or dump the contents of /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Linux Auditd, focusing on processes like 'cat', 'nano', 'vim', and 'vi' accessing these files. This activity is significant as it may indicate credential dumping, a technique used by adversaries to gain persistence or escalate privileges. If confirmed malicious, privileges. If confirmed malicious, attackers could obtain hashed passwords for offline cracking, leading to unauthorized access and potential system compromise.",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can execute this command. Please update the filter macros to remove false positives."
  ],
  "from": "now-60m",
  "interval": "5m",
  "license": "Elastic License v2",
  "name": "Google Gemini 2.0 Flash 001: Linux Auditd Possible Access To Credential Files",
  "note": "This rule was converted with Google Gemini 2.0 Flash 001",
  "references": [
    "https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd",
    "https://attack.mitre.org/techniques/T1003/008/"
  ],
  "risk_score": 47,
  "rule_id": "0419cb7a-57ea-467b-974f-77c303dfe2a3",
  "severity": "medium",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "Linux Privilege Escalation",
    "Compromised Linux Host",
    "Linux Persistence Techniques",
    "China-Nexus Threat Activity",
    "Earth Estries",
    "T1003.008",
    "Endpoint"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1003",
          "name": "OS Credential Dumping",
          "reference": "https://attack.mitre.org/techniques/T1003/",
          "subtechnique": [
            {
              "id": "T1003.008",
              "name": "/etc/passwd and /etc/shadow",
              "reference": "https://attack.mitre.org/techniques/T1003/008/"
            }
          ]
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "type": "eql",
  "version": 7,
  "language": "eql",
  "query": "sequence by host.name\n  [process where event.category == \"process\" and event.type == \"start\" and\n   process.executable != null and process.name in (\"cat\", \"nano\", \"vim\", \"vi\") and\n   wildcard(process.args, \"*shadow*\", \"*passwd*\")]\n  [file where event.category == \"file\" and event.type == \"access\" and\n   file.path in (\"/etc/shadow\", \"/etc/passwd\")]",
  "index": [
    "auditbeat-*",
    "filebeat-*",
    "logs-endpoint.events.*",
    "logs-system.*"
  ]
}