{
  "actions": [],
  "author": [
    "Teoderick Contreras, Splunk",
    "Google Gemini 2.0 Flash 001"
  ],
  "building_block_type": "default",
  "description": "The following analytic detects the execution of the 'shred' command on a Linux machine, which is used to overwrite files to make them unrecoverable. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because the 'shred' command can be used in destructive attacks, such as those seen in the Industroyer2 malware targeting energy facilities. If confirmed malicious, this activity could lead to the permanent destruction of critical files, severely impacting system integrity and data availability.\n\nRule converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."
  ],
  "from": "now-60m",
  "interval": "10m",
  "license": "Elastic License v2",
  "name": "Google Gemini 2.0 Flash 001: Linux Shred Overwrite Command",
  "note": "The following analytic detects the execution of the 'shred' command on a Linux machine, which is used to overwrite files to make them unrecoverable. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because the 'shred' command can be used in destructive attacks, such as those seen in the Industroyer2 malware targeting energy facilities. If confirmed malicious, this activity could lead to the permanent destruction of critical files, severely impacting system integrity and data availability.",
  "references": [
    "https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/",
    "https://cert.gov.ua/article/39518"
  ],
  "risk_score": 47,
  "rule_id": "c1952cf1-643c-4965-82de-11c067cbae76",
  "severity": "high",
  "tags": [
    "Industroyer2",
    "AwfulShred",
    "Linux Privilege Escalation",
    "Data Destruction",
    "Linux Persistence Techniques",
    "Endpoint",
    "T1485",
    "Google Gemini 2.0 Flash 001"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0040",
        "name": "Impact",
        "reference": "https://attack.mitre.org/tactics/TA0040/"
      },
      "technique": [
        {
          "id": "T1485",
          "name": "Data Destruction",
          "reference": "https://attack.mitre.org/techniques/T1485/"
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "type": "eql",
  "version": 1,
  "language": "eql",
  "query": "sequence by process.entity_id\n  [process where event.type == \"start\" and process.name == \"shred\" and process.args : (\"-n*\", \"-u*\", \"-z*\", \"-s*\")]\n",
  "index": [
    "logs-endpoint.events.*"
  ]
}