{
  "actions": [],
  "author": ["Teoderick Contreras, Splunk", "OpenAI GPT4-o"],
  "description": "The following analytic detects attempts to access or dump the contents of /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on processes like 'cat', 'nano', 'vim', and 'vi' accessing these files. This activity is significant as it may indicate credential dumping, a technique used by adversaries to gain persistence or escalate privileges. If confirmed malicious, attackers could obtain hashed passwords for offline cracking, leading to unauthorized access and potential system compromise. Converted with OpenAI GPT4-o.",
  "enabled": true,
  "false_positives": ["Administrator or network operator can execute this command. Please update the filter macros to remove false positives."],
  "from": "now-360s",
  "index": ["logs-*"],
  "interval": "5m",
  "language": "eql",
  "max_signals": 100,
  "name": "OpenAI GPT4-o Linux Possible Access To Credential Files",
  "output_index": ".siem-signals-default",
  "references": [
    "https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd",
    "https://attack.mitre.org/techniques/T1003/008/"
  ],
  "risk_score": 50,
  "risk_score_mapping": [],
  "rule_id": "16107e0e-71fc-11ec-b862-acde48001122",
  "severity": "medium",
  "severity_mapping": [],
  "tags": [
    "OpenAI GPT4-o",
    "China-Nexus Threat Activity",
    "Linux Persistence Techniques",
    "XorDDos",
    "Linux Privilege Escalation",
    "Earth Estries",
    "Endpoint",
    "Splunk Enterprise",
    "Splunk Enterprise Security",
    "Splunk Cloud"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1003",
          "name": "OS Credential Dumping",
          "reference": "https://attack.mitre.org/techniques/T1003/",
          "subtechnique": [
            {
              "id": "T1003.008",
              "name": "Credentials in Files",
              "reference": "https://attack.mitre.org/techniques/T1003/008/"
            }
          ]
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "to": "now",
  "type": "eql",
  "version": 8,
  "query": "process where process.name in (\"cat\", \"nano*\", \"vim*\", \"vi*\") and process.args : (\"*/etc/shadow*\", \"*/etc/passwd*\")"
}