{
  "actions": [],
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects the execution of a kworker process with a command line in writable directories such as /home/, /var/log, and /tmp on a Linux machine. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process paths. This activity is significant as kworker processes are typically kernel threads, and their presence in writable directories is unusual and indicative of potential malware, such as CyclopsBlink. If confirmed malicious, this could allow attackers to blend malicious processes with legitimate ones, leading to persistent access and further system compromise.",
  "enabled": true,
  "false_positives": [
    "unknown"
  ],
  "from": "now-60m",
  "interval": "10m",
  "license": "Elastic License v2",
  "name": "Google Gemini 2.0 Flash 001: Linux Kworker Process In Writable Process Path",
  "note": "Rule converted with Google Gemini 2.0 Flash 001",
  "references": [
    "https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf",
    "https://www.trendmicro.com/en_us/research/22/c/cyclops-blink-sets-sights-on-asus-routers--.html"
  ],
  "risk_score": 73,
  "rule_id": "linux_kworker_process_in_writable_process_path",
  "severity": "high",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "Sandworm Tools",
    "Cyclops Blink",
    "Endpoint",
    "T1036.004"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0007",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0007/"
      },
      "technique": [
        {
          "id": "T1036",
          "name": "Masquerading",
          "reference": "https://attack.mitre.org/techniques/T1036/",
          "subtechnique": [
            {
              "id": "T1036.004",
              "name": "Masquerade Task or Service",
              "reference": "https://attack.mitre.org/techniques/T1036/004/"
            }
          ]
        }
      ]
    }
  ],
  "to": "now",
  "type": "eql",
  "version": 1,
  "language": "eql",
  "query": """sequence by process.entity_id
    [process where event.type == "start" and
     process.parent.name like "*kworker/*" and
     process.parent.executable in ("/home/*", "/tmp/*", "/var/log/*") and
     process.name like "*iptables*"]""",
  "index": [
    "logs-endpoint.events.*"
  ]
}