{
  "actions": [],
  "alias_purpose": null,
  "alias_target_id": null,
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "building_block_type": null,
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects potential tampering with cronjob files\non a Linux system by identifying 'echo' commands that append code to existing cronjob\nfiles. It leverages logs from Linux Auditd, focusing on process names, parent processes,\nand command-line executions. This activity is significant because adversaries often\nuse it for persistence or privilege escalation. If confirmed malicious, this could\nallow attackers to execute unauthorized code automatically, leading to system compromises\nand unauthorized data access, thereby impacting business operations and data integrity.",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": [
    "False positives may arise from legitimate actions by administrators or network operators who may use these commands for automation purposes. Therefore, it's recommended to adjust filter macros to eliminate such false positives."
  ],
  "from": "now-60m",
  "interval": "5m",
  "investigation_fields": {
    "field_names": []
  },
  "license": null,
  "max_signals": 100,
  "meta": {
    "version": 6
  },
  "name": "Google Gemini 2.0 Flash 001: Linux Auditd Possible Append Cronjob Entry On Existing Cronjob File",
  "namespace": "default",
  "note": "Rule converted with Google Gemini 2.0 Flash 001",
  "outcome": null,
  "output_index": ".siem-signals-default",
  "references": [
    "https://attack.mitre.org/techniques/T1053/003/",
    "https://blog.aquasec.com/threat-alert-kinsing-malware-container-vulnerability",
    "https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/"
  ],
  "related_integrations": [],
  "required_fields": [],
  "response_actions": [],
  "risk_score": 50,
  "risk_score_mapping": [],
  "rule_id": "linux_auditd_possible_append_cronjob_entry",
  "rule_name_override": null,
  "setup": null,
  "severity": "medium",
  "severity_mapping": [],
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "analytic_story:XorDDos",
    "analytic_story:Linux Living Off The Land",
    "analytic_story:Compromised Linux Host",
    "analytic_story:Linux Privilege Escalation",
    "analytic_story:Scheduled Tasks",
    "analytic_story:Linux Persistence Techniques",
    "asset_type:Endpoint",
    "mitre_attack_id:T1053.003",
    "product:Splunk Enterprise",
    "product:Splunk Enterprise Security",
    "product:Splunk Cloud",
    "security_domain:endpoint"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1053",
          "name": "Scheduled Task/Job",
          "reference": "https://attack.mitre.org/techniques/T1053/",
          "subtechnique": [
            {
              "id": "T1053.003",
              "name": "Cron",
              "reference": "https://attack.mitre.org/techniques/T1053/003/"
            }
          ]
        }
      ]
    }
  ],
  "throttle": null,
  "timeline_id": null,
  "timeline_title": null,
  "timestamp_override": null,
  "timestamp_override_fallback_disabled": false,
  "to": "now",
  "version": 1,
  "language": "eql",
  "query": "sequence by host.name\n  [process where event.type == \"start\" and process.name == \"auditd\"]\n  [file where file.path : \"/etc/cron*\" or file.path : \"/var/spool/cron/*\" or file.path : \"/etc/anacrontab*\" and event.type == \"change\"]",
  "type": "eql",
  "alert_suppression": {
    "duration": {
      "unit": "m",
      "value": 5
    },
    "group_by": [],
    "missing_fields_strategy": "do_not_suppress"
  },
  "data_view_id": "default",
  "event_category_override": null,
  "filters": [],
  "index": [
    "auditbeat-*",
    "filebeat-*",
    "logs-endpoint.events.*",
    "logs-system.*"
  ],
  "tiebreaker_field": null,
  "timestamp_field": null
}