{
  "actions": [],
  "alias_purpose": "detection_rule",
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "building_block_type": "default",
  "description": "Google Gemini 2.0 Flash 001: The following analytic identifies potential enumeration of local network configuration on Linux systems. It detects this activity by monitoring processes such as \"arp,\" \"ifconfig,\" \"ip,\" \"netstat,\" \"firewall-cmd,\" \"ufw,\" \"iptables,\" \"ss,\" and \"route\" within a 30-minute window. This behavior is significant as it often indicates reconnaissance efforts by adversaries to gather network information for subsequent attacks. If confirmed malicious, this activity could enable attackers to map the network, identify vulnerabilities, and plan further exploitation or lateral movement within the environment. Rule converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can execute this command. Please update the filter macros to remove false positives."
  ],
  "from": "now-30m",
  "interval": "1m",
  "license": "Elastic License v2",
  "max_signals": 100,
  "name": "Google Gemini 2.0 Flash 001: Linux System Network Discovery",
  "note": "Network discovery process executed.",
  "output_index": ".siem-signals-default",
  "references": [
    "https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md"
  ],
  "risk_score": 47,
  "rule_id": "535cb214-8b47-11ec-a2c7-acde48001122",
  "severity": "low",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "Data Destruction",
    "Network Discovery",
    "Industroyer2",
    "Endpoint",
    "T1016"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0007",
        "name": "Discovery",
        "reference": "https://attack.mitre.org/tactics/TA0007/"
      },
      "technique": [
        {
          "id": "T1016",
          "name": "System Network Configuration Discovery",
          "reference": "https://attack.mitre.org/techniques/T1016/"
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "type": "eql",
  "version": 1,
  "language": "eql",
  "query": """sequence by process.entity_id
    [process where event.type == "start" and process.name in ("arp", "ifconfig", "ip", "netstat", "firewall-cmd", "ufw", "iptables", "ss", "route")] with runs=4
    """,
  "index": [
    "logs-endpoint.events.*"
  ],
  "data_view_id": "default"
}