{
  "actions": [],
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects attempts to access or dump the contents\nof /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Endpoint\nDetection and Response (EDR) agents, focusing on processes like 'cat', 'nano', 'vim',\nand 'vi' accessing these files. This activity is significant as it may indicate\ncredential dumping, a technique used by adversaries to gain persistence or escalate\nprivileges. If confirmed malicious, attackers could obtain hashed passwords for\noffline cracking, leading to unauthorized access and potential system compromise.",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can execute this command. Please update the filter macros to remove false positives."
  ],
  "from": "now-60m",
  "interval": "5m",
  "license": "Apache 2.0",
  "name": "Google Gemini 2.0 Flash 001: Linux Possible Access To Credential Files",
  "note": "This rule was converted with Google Gemini 2.0 Flash 001",
  "references": [
    "https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd",
    "https://attack.mitre.org/techniques/T1003/008/"
  ],
  "risk_score": 47,
  "rule_id": "16107e0e-71fc-11ec-b862-acde48001122",
  "severity": "medium",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "analytic_story:China-Nexus Threat Activity",
    "analytic_story:Linux Persistence Techniques",
    "analytic_story:XorDDos",
    "analytic_story:Linux Privilege Escalation",
    "analytic_story:Earth Estries",
    "asset_type:Endpoint",
    "mitre_attack_id:T1003.008",
    "product:Splunk Enterprise",
    "product:Splunk Enterprise Security",
    "product:Splunk Cloud",
    "security_domain:endpoint"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1003",
          "name": "OS Credential Dumping",
          "reference": "https://attack.mitre.org/techniques/T1003/",
          "subtechnique": [
            {
              "id": "T1003.008",
              "name": "/etc/passwd and /etc/shadow",
              "reference": "https://attack.mitre.org/techniques/T1003/008/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1,
  "language": "eql",
  "query": "sequence by host.name\n  [process where event.type == \"start\" and process.name in (\"cat\", \"nano\", \"vim\", \"vi\") and process.args in (\"/etc/shadow\", \"/etc/passwd\")]\n",
  "index": [
    "logs-endpoint.events.*"
  ],
  "data_view_id": "default"
}