{
  "actions": [],
  "alias_purpose": null,
  "alias_target_id": null,
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "building_block_type": null,
  "description": "The following analytic detects attempts to access or dump the contents of /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Linux Auditd, focusing on processes like 'cat', 'nano', 'vim', and 'vi' accessing these files. This activity is significant as it may indicate credential dumping, a technique used by adversaries to gain persistence or escalate privileges. If confirmed malicious, privileges. If confirmed malicious, attackers could obtain hashed passwords for offline cracking, leading to unauthorized access and potential system compromise.\n\nRule converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": [
    "Administrator or network operator can execute this command. Please update the filter macros to remove false positives."
  ],
  "from": "now-60m",
  "interval": "5m",
  "investigation_fields": {
    "field_names": []
  },
  "license": null,
  "max_signals": 100,
  "meta": {
    "data_source": [
      "Linux Auditd Proctitle"
    ],
    "date": "2025-02-24",
    "how_to_implement": "To implement this detection, the process begins by ingesting auditd data, that consist SYSCALL, TYPE, EXECVE and PROCTITLE events, which captures command-line executions and process details on Unix/Linux systems. These logs should be ingested and processed using Splunk Add-on for Unix and Linux (https://splunkbase.splunk.com/app/833), which is essential for correctly parsing and categorizing the data. The next step involves normalizing the field names  to match the field names set by the Splunk Common Information Model (CIM) to ensure consistency across different data sources and enhance the efficiency of data modeling. This approach enables effective monitoring and detection of linux endpoints where auditd is deployed",
    "id": "0419cb7a-57ea-467b-974f-77c303dfe2a3",
    "references": [
      "https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd",
      "https://attack.mitre.org/techniques/T1003/008/"
    ],
    "rba": {
      "message": "A [process.title] event occurred on host - [host.name] to access or dump the contents of /etc/passwd and /etc/shadow files.",
      "risk_objects": [
        {
          "field": "host.name",
          "score": 25,
          "type": "system"
        }
      ],
      "threat_objects": []
    },
    "tests": [
      {
        "attack_data": [
          {
            "data": "https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.008/linux_auditd_access_credential/auditd_proctitle_access_cred.log",
            "source": "auditd",
            "sourcetype": "auditd"
          }
        ],
        "name": "True Positive Test"
      }
    ]
  },
  "name": "Google Gemini 2.0 Flash 001 Linux Auditd Possible Access To Credential Files",
  "namespace": "default",
  "note": null,
  "outcome": "exactMatch",
  "output_index": ".siem-signals-default",
  "references": [
    "https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd",
    "https://attack.mitre.org/techniques/T1003/008/"
  ],
  "related_integrations": [],
  "required_fields": [
    {
      "name": "process.title",
      "type": "string"
    },
    {
      "name": "host.name",
      "type": "string"
    }
  ],
  "response_actions": [],
  "risk_score": 47,
  "risk_score_mapping": [],
  "rule_id": "linux_auditd_possible_access_to_credential_files",
  "rule_name_override": null,
  "setup": null,
  "severity": "medium",
  "severity_mapping": [],
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "Linux Privilege Escalation",
    "Compromised Linux Host",
    "Linux Persistence Techniques",
    "China-Nexus Threat Activity",
    "Earth Estries",
    "Endpoint",
    "T1003.008",
    "Splunk Enterprise",
    "Splunk Enterprise Security",
    "Splunk Cloud",
    "endpoint"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1003",
          "name": "OS Credential Dumping",
          "reference": "https://attack.mitre.org/techniques/T1003/",
          "subtechnique": [
            {
              "id": "T1003.008",
              "name": " /etc/passwd and /etc/shadow",
              "reference": "https://attack.mitre.org/techniques/T1003/008/"
            }
          ]
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "timeline_id": null,
  "timeline_title": null,
  "timestamp_override": null,
  "timestamp_override_fallback_disabled": true,
  "to": "now",
  "version": 1,
  "language": "eql",
  "query": "sequence by host.name\n  [process where process.title : (\"*shadow*\", \"*passwd*\") and process.title : (\"*cat *\", \"*nano *\", \"*vim *\", \"*vi *\")]\n",
  "type": "eql",
  "alert_suppression": {
    "duration": {
      "unit": "m",
      "value": 5
    },
    "group_by": [],
    "missing_fields_strategy": "doNotSuppress"
  },
  "data_view_id": "default",
  "event_category_override": null,
  "filters": [],
  "index": [
    "auditbeat-*",
    "filebeat-*",
    "logs-endpoint.events.*",
    "logs-system.*"
  ],
  "tiebreaker_field": null,
  "timestamp_field": null
}