{
  "actions": [],
  "author": [
    "Teoderick Contreras",
    "OpenAI GPT4-o"
  ],
  "description": "The following analytic detects the suspicious editing of cron jobs in Linux using the crontab command-line parameter (-e). It identifies this activity by monitoring command-line executions involving 'crontab' and the edit parameter. This behavior is significant for a SOC as cron job manipulations can indicate unauthorized persistence attempts or scheduled malicious actions. If confirmed malicious, this activity could lead to system compromise, unauthorized access, or broader network compromise. Converted with OpenAI GPT4-o.",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."
  ],
  "from": "now-360s",
  "index": [
    "logs-endpoint"
  ],
  "interval": "5m",
  "language": "eql",
  "max_signals": 100,
  "name": "OpenAI GPT4-o Linux Edit Cron Table Parameter",
  "query": "process where process.name == \"crontab\" and process.command_line : \"*crontab*\" and process.command_line : \"*-e*\"",
  "references": [
    "https://attack.mitre.org/techniques/T1053/003/"
  ],
  "risk_score": 50,
  "risk_score_mapping": [],
  "rule_id": "linux_edit_cron_table_parameter",
  "severity": "medium",
  "tags": [
    "Linux Privilege Escalation",
    "Linux Persistence Techniques",
    "Linux Living Off The Land",
    "Scheduled Tasks",
    "Endpoint",
    "Splunk Enterprise",
    "Splunk Enterprise Security",
    "Splunk Cloud",
    "OpenAI GPT4-o"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1053",
          "name": "Scheduled Task/Job",
          "reference": "https://attack.mitre.org/techniques/T1053/",
          "subtechnique": [
            {
              "id": "T1053.003",
              "name": "Cron",
              "reference": "https://attack.mitre.org/techniques/T1053/003/"
            }
          ]
        }
      ]
    }
  ],
  "version": 1,
  "exceptions_list": [],
  "throttle": "no_actions",
  "type": "eql"
}