{
  "actions": [],
  "author": ["Michael Haag", "Splunk", "0xC0FFEEEE", "Github Community", "OpenAI GPT4-o"],
  "description": "The following analytic detects the use of the `curl` command with proxy-related arguments such as `-x`, `socks`, `--preproxy`, and `--proxy`. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions and process details. This activity is significant as it may indicate an adversary attempting to use a proxy to evade network monitoring and obscure their actions. If confirmed malicious, this behavior could allow attackers to bypass security controls, making it difficult to track their activities and potentially leading to unauthorized data access or exfiltration. Converted with OpenAI GPT4-o.",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": ["False positives may be present based on proxy usage internally. Filter as needed."],
  "from": "now-6h",
  "interval": "5m",
  "license": "",
  "max_signals": 100,
  "meta": {},
  "name": "OpenAI GPT4-o Linux Proxy Socks Curl",
  "query": "process where process.name == \"curl\" and (process.args : \"*-x *\" or process.args : \"*socks4a://*\" or process.args : \"*socks5h://*\" or process.args : \"*socks4://*\" or process.args : \"*socks5://*\" or process.args : \"*--preproxy *\" or process.args : \"--proxy*\")",
  "references": [
    "https://www.offensive-security.com/metasploit-unleashed/proxytunnels/",
    "https://curl.se/docs/manpage.html",
    "https://en.wikipedia.org/wiki/SOCKS",
    "https://oxylabs.io/blog/curl-with-proxy",
    "https://reqbin.com/req/c-ddxflki5/curl-proxy-server#:~:text=To%20use%20a%20proxy%20with,be%20URL%20decoded%20by%20Curl.",
    "https://gtfobins.github.io/gtfobins/curl/"
  ],
  "risk_score": 56,
  "risk_score_mapping": [],
  "rule_id": "bd596c22-ad1e-44fc-b242-817253ce8b08",
  "severity": "medium",
  "severity_mapping": [],
  "tags": ["OpenAI GPT4-o", "Linux Living Off The Land", "Ingress Tool Transfer", "Endpoint", "Splunk Enterprise", "Splunk Enterprise Security", "Splunk Cloud", "endpoint"],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0008",
        "name": "Defensive Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0008/"
      },
      "technique": [
        {
          "id": "T1090",
          "name": "Proxy",
          "reference": "https://attack.mitre.org/techniques/T1090/"
        },
        {
          "id": "T1095",
          "name": "Non-Application Layer Protocol",
          "reference": "https://attack.mitre.org/techniques/T1095/"
        }
      ]
    }
  ],
  "throttle": "no_actions",
  "version": 1,
  "language": "eql",
  "type": "eql"
}