{
  "actions": [],
  "author": ["Teoderick Contreras", "OpenAI GPT4-o"],
  "description": "The following analytic detects the execution of a Unix shell command designed to wipe root directories on a Linux host. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on the 'rm' command with force recursive deletion and the '--no-preserve-root' option. This activity is significant as it indicates potential data destruction attempts, often associated with malware like Awfulshred. If confirmed malicious, this behavior could lead to severe data loss, system instability, and compromised integrity of the affected Linux host. Immediate investigation and response are crucial to mitigate potential damage. This rule was converted with OpenAI GPT4-o.",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": ["unknown"],
  "from": "now-6m",
  "index": ["logs-*"],
  "interval": "5m",
  "language": "eql",
  "max_signals": 100,
  "name": "OpenAI GPT4-o Linux Data Destruction Command",
  "note": "",
  "query": "process where process.name == \"rm\" and process.command_line regex \"(?i).* (-rf|-fr).* --no-preserve-root.*\"",
  "references": [
    "https://cert.gov.ua/article/3718487",
    "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/"
  ],
  "risk_score": 73,
  "rule_id": "b11d3979-b2f7-411b-bb1a-bd00e642173b",
  "severity": "high",
  "tags": ["OpenAI GPT4-o", "AwfulShred", "Data Destruction", "endpoint", "Splunk Enterprise", "Splunk Enterprise Security", "Splunk Cloud"],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0040",
        "name": "Impact",
        "reference": "https://attack.mitre.org/tactics/TA0040/"
      },
      "technique": [
        {
          "id": "T1485",
          "name": "Data Destruction",
          "reference": "https://attack.mitre.org/techniques/T1485/"
        }
      ]
    }
  ],
  "type": "eql",
  "version": 5
}