{
  "actions": [],
  "alias_purpose": null,
  "alias_target_id": null,
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "building_block_type": null,
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects the suspicious disable or modify system firewall. This behavior is critical for a SOC to monitor because it may indicate attempts to gain unauthorized access or maintain control over a system. Such actions could be signs of malicious activity. If confirmed, this could lead to serious consequences, including a compromised system, unauthorized access to sensitive data, or even a wider breach affecting the entire network. Detecting and responding to these signs early is essential to prevent potential security incidents. This rule was converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "exceptions_list": [],
  "false_positives": [
    "Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."
  ],
  "from": "now-60s",
  "interval": "10s",
  "investigation_fields": {
    "field_names": []
  },
  "license": null,
  "max_signals": 100,
  "meta": {},
  "name": "Google Gemini 2.0 Flash 001: Linux Auditd Disable Or Modify System Firewall",
  "namespace": "default",
  "note": null,
  "outcome": null,
  "output_index": ".siem-signals-default",
  "references": [
    "https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html"
  ],
  "related_integrations": [],
  "required_fields": [
    "host",
    "event.type",
    "process.pid",
    "user.id",
    "process.name",
    "process.executable",
    "service.name"
  ],
  "response_actions": [],
  "risk_score": 64,
  "risk_score_mapping": [],
  "rule_id": "linux_auditd_disable_or_modify_system_firewall",
  "rule_name_override": null,
  "setup": null,
  "severity": "high",
  "severity_mapping": [],
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "analytic_story:Linux Living Off The Land",
    "analytic_story:Linux Privilege Escalation",
    "analytic_story:Linux Persistence Techniques",
    "analytic_story:Compromised Linux Host",
    "asset_type:Endpoint",
    "mitre_attack_id:T1562.004",
    "product:Elastic Security",
    "security_domain:endpoint"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0005",
        "name": "Defense Evasion",
        "reference": "https://attack.mitre.org/tactics/TA0005/"
      },
      "technique": [
        {
          "id": "T1562.004",
          "name": "Impair Defenses: Disable or Modify System Firewall",
          "reference": "https://attack.mitre.org/techniques/T1562/004/",
          "subtechnique": []
        }
      ]
    }
  ],
  "throttle": null,
  "timeline_id": null,
  "timeline_title": null,
  "timestamp_override": null,
  "timestamp_override_fallback_disabled": false,
  "to": "now",
  "version": 1,
  "language": "eql",
  "query": "sequence by host.name\n  [process where event.type == \"start\" and process.name == \"auditd\"]\n  [service where event.type == \"stop\" and service.name in (\"firewalld\", \"ufw\")]",
  "type": "eql",
  "alert_suppression": {
    "duration": {
      "unit": "s",
      "value": 60
    },
    "group_by": [
      "host.name",
      "process.pid",
      "user.id",
      "process.name",
      "process.executable",
      "service.name"
    ],
    "missing_fields_strategy": "do_not_suppress"
  },
  "data_view_id": null,
  "event_category_override": null,
  "filters": [
    {
      "query": "event.category:\"process\"",
      "exists": false
    },
    {
      "query": "event.category:\"service\"",
      "exists": false
    }
  ],
  "index": [
    "auditbeat-*",
    "logs-system.*",
    "endgame-*"
  ],
  "tiebreaker_field": null,
  "timestamp_field": null
}