{
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras"
  ],
  "description": "Google Gemini 2.0 Flash 001: The following analytic detects suspicious modifications to cron jobs on Linux systems using the crontab command with list parameters. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it may indicate an attempt to establish persistence or execute malicious code on a schedule. If confirmed malicious, the impact could include unauthorized code execution, data destruction, or other damaging outcomes. Further investigation should analyze the added cron job, its associated command, and any related processes. Rule was converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "false_positives": [
    "Administrator or network operator can use this application for automation purposes. Please update the filter macros to remove false positives."
  ],
  "from": "now-60m",
  "index": [
    "logs-endpoint.events.*",
    "endgame-*"
  ],
  "interval": "10m",
  "license": "Elastic License v2",
  "name": "Google Gemini 2.0 Flash 001: Linux Adding Crontab Using List Parameter",
  "note": "Investigate any identified instances of crontab being used with list parameters (-l) to ensure they are legitimate and not indicative of malicious activity.",
  "references": [
    "https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/",
    "https://cert.gov.ua/article/39518"
  ],
  "risk_score": 47,
  "rule_id": "linux_adding_crontab_using_list_parameter",
  "severity": "medium",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "Industroyer2",
    "Linux Privilege Escalation",
    "Linux Living Off The Land",
    "Data Destruction",
    "Linux Persistence Techniques",
    "Scheduled Tasks",
    "Gomir",
    "Endpoint",
    "T1053.003"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0003",
        "name": "Persistence",
        "reference": "https://attack.mitre.org/tactics/TA0003/"
      },
      "technique": [
        {
          "id": "T1053",
          "name": "Scheduled Task/Job",
          "reference": "https://attack.mitre.org/techniques/T1053/",
          "subtechnique": [
            {
              "id": "T1053.003",
              "name": "Cron",
              "reference": "https://attack.mitre.org/techniques/T1053/003/"
            }
          ]
        }
      ]
    }
  ],
  "type": "eql",
  "version": 1,
  "query": """sequence by process.entity_id
  [process where event.type == "start" and process.name == "crontab" and process.args : "*-l*"]
  """,
  "language": "eql"
}