{
  "actions": [],
  "author": [
    "Google Gemini 2.0 Flash 001",
    "Teoderick Contreras, Splunk"
  ],
  "description": "The following analytic detects a high frequency of file deletions in\nthe /etc/ folder on Linux systems. It leverages the Endpoint.Filesystem data model\nto identify instances where 200 or more files are deleted within an hour, grouped\nby process name and process ID. This behavior is significant as it may indicate\nthe presence of wiper malware, such as AcidRain, which aims to delete critical system\nfiles. If confirmed malicious, this activity could lead to severe system instability,\ndata loss, and potential disruption of services.\n\nRule converted with Google Gemini 2.0 Flash 001",
  "enabled": true,
  "false_positives": [
    "linux package installer/uninstaller may cause this event. Please update you filter macro to remove false positives."
  ],
  "from": "now-1h",
  "interval": "1h",
  "license": "Elastic License v2",
  "name": "Google Gemini 2.0 Flash 001 Linux High Frequency Of File Deletion In Etc Folder",
  "note": "Rule converted with Google Gemini 2.0 Flash 001",
  "references": [
    "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/"
  ],
  "risk_score": 47,
  "rule_id": "9d867448-2aff-4d07-876c-89409a752ff8",
  "severity": "high",
  "tags": [
    "Google Gemini 2.0 Flash 001",
    "analytic_story:AcidRain",
    "analytic_story:Data Destruction",
    "asset_type:Endpoint",
    "mitre_attack_id:T1070.004",
    "mitre_attack_id:T1485",
    "product:Elastic Security",
    "security_domain:endpoint"
  ],
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0040",
        "name": "Impact",
        "reference": "https://attack.mitre.org/tactics/TA0040/"
      },
      "technique": [
        {
          "id": "T1485",
          "name": "Data Destruction",
          "reference": "https://attack.mitre.org/techniques/T1485/"
        },
        {
          "id": "T1070",
          "name": "Indicator Removal on Host",
          "reference": "https://attack.mitre.org/techniques/T1070/"
        }
      ]
    }
  ],
  "type": "eql",
  "query": """sequence by process.entity_id with maxspan=1h
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*" ]
    [file where event.action == "deleted" and file.path : "/etc/*